Terraform Plan for `Directory: edge` and `Workspace: default`:

```
[command]/home/runner/work/_temp/e2a22b02-f852-40c7-8069-519aa7cd6aa3/terraform-bin plan -no-color -out=tfplan
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
::debug::Terraform exited with code 0.
::debug::stdout: aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # aws_security_group.example must be replaced%0A-/+ resource "aws_security_group" "example" {%0A      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)%0A      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)%0A      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement%0A      + name_prefix            = (known after apply)%0A      ~ owner_id               = "788932519567" -> (known after apply)%0A        tags                   = {%0A            "Name" = "example-security-group"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 0 to change, 1 to destroy.%0A%0AChanges to Outputs:%0A  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tfplan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tfplan"%0A
::debug::stderr: 
::debug::exitcode: 0
stdout<<ghadelimiter_2530b6a2-6d0e-497c-bbc4-941d1529d7b8
aws_security_group.example: Refreshing state... [id=sg-0954367191803e0a8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.example must be replaced
-/+ resource "aws_security_group" "example" {
      ~ arn                    = "arn:aws:ec2:us-east-1:788932519567:security-group/sg-0954367191803e0a8" -> (known after apply)
      ~ id                     = "sg-0954367191803e0a8" -> (known after apply)
      ~ name                   = "terra-security-group" -> "edge-terra-security-group" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "788932519567" -> (known after apply)
        tags                   = {
            "Name" = "example-security-group"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ security_group_id = "sg-0954367191803e0a8" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

ghadelimiter_2530b6a2-6d0e-497c-bbc4-941d1529d7b8
stderr<<ghadelimiter_15d9c0a8-eb1c-4b3c-872b-0dd6b6a83397

ghadelimiter_15d9c0a8-eb1c-4b3c-872b-0dd6b6a83397
exitcode<<ghadelimiter_c8ff96a2-892b-47cc-ae99-d2c63e4b7fd1
0
ghadelimiter_c8ff96a2-892b-47cc-ae99-d2c63e4b7fd1
```

Plan saved to GitHub artifacts.